<?php

namespace Database\Seeders;

use App\Models\Joke;
use Faker\Factory;
use Illuminate\Database\Seeder;

class Jokeseeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
//        نمی دانم کار کرد یا نه؟
        // $faker = \Faker\Factory::create();
        // foreach(range(1,10) as $item){
        // Joke::create(['title' => $faker->text(5),'body' => $faker->paragraph(rand(40 ,60))]);
        // }

        Joke::create(['title' => 'نرده', 'body' => 'یه روز یه مرده میره میخوره به نرده بر می گرده.', 'user_id' => 1]);
        Joke::create(['title' => 'گاز', 'body' => 'یه بارم بابام کنتور گاز رو دستکاری کرد، روزی ١٣٠٠ تومن اداره گاز باید به ما پول میداد', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'خرید', 'body' => '‏یارو ﺍﺯ ﻣﻐﺎﺯﻩ ﻣﯿﺎﺩ ﺑﯿﺮﻭﻥ ﻏﺶ ﻏﺶ ﻣﯿﺨﻨﺪﻩ. می گن چی شده؟  ‏ﻣﯿﮕﻪ:رفتم مغازه اسگلشون کردم. ‏میگن:چی کار کردی…؟ ‏میگه:ﭘﻮﻝ ﺩﺍﺩﻡ ﻫﯿﭽﯽ ﻧﺨﺮﯾﺪﻡ.', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'معلول', 'body' => 'امروز یه پشه یه ربع بی حرکت نشسته بود رو میز ناهار خوری منم سریع زدم لهش کردم!! بعد از چن دقیقه یه پشه دیگه اومد بالا سرم گفت: بی وجدان اون معلول بوود. لامصب داغون شدم با حرفش', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'خرس', 'body' => 'پسرها بعد 10 دقیقه به تفاهم میرسند که روز جمعه برای تفریح کجا برن . دخترها بعد 4 ساعت بحث ،تفریحشون لغو میشه چون الهه به نسترن گفت :خرس.', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'لنگه', 'body' => 'دنبال نیمه گمشدتون نگردید بعضی هام مثل ما لنگه به لنگه آفریده شدن! یعنی همون بعضیام مثل من لنگه ندارن.', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'سرعت', 'body' => 'افسر :خانم شما با سرعت غیر مجاز رانندگی میکردیدخواهش میکنم بزارید برم، من معلم هستم الان کلاسم دیر میشه . افسر :معلم؟ یه عمر منتظر این روز بودم، حالا شروع کن هزار بار بنویس “من دیگه با سرعت غیر مجاز رانندگی نمیکنم"', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'بتهون', 'body' => 'دقت کردین : بعضی اوقات بچه های کلاس با میز و نیمکت یک اهنگهایی میسازن که بتهوون که سهله بابای بتهوونم نمی تونه اونا رو بسازه', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'کتک', 'body' => 'سر ناهار دستم خورد به بطری آب همش ریخت تو غذای بابام.. هر کی بود یه چک میخوابوند زیر گوش بچه ش.....ولی بابام نزد.....بشقابشو با بشقابم عوض کرد....', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'دکل', 'body' => '‏یه جوری میگین کوالا فقط میخوره و میخوابه انگار مثلا گوسفند 5 صبح بیدار میشه یه چایی تلخ میخوره تا شب میره سر دکل نفت', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'نرده', 'body' => 'یه روز یه مرده میره میخوره به نرده بر می گرده.', 'user_id' => 1]);
        Joke::create(['title' => 'گاز', 'body' => 'یه بارم بابام کنتور گاز رو دستکاری کرد، روزی ١٣٠٠ تومن اداره گاز باید به ما پول میداد', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'خرید', 'body' => '‏یارو ﺍﺯ ﻣﻐﺎﺯﻩ ﻣﯿﺎﺩ ﺑﯿﺮﻭﻥ ﻏﺶ ﻏﺶ ﻣﯿﺨﻨﺪﻩ. می گن چی شده؟  ‏ﻣﯿﮕﻪ:رفتم مغازه اسگلشون کردم. ‏میگن:چی کار کردی…؟ ‏میگه:ﭘﻮﻝ ﺩﺍﺩﻡ ﻫﯿﭽﯽ ﻧﺨﺮﯾﺪﻡ.', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'معلول', 'body' => 'امروز یه پشه یه ربع بی حرکت نشسته بود رو میز ناهار خوری منم سریع زدم لهش کردم!! بعد از چن دقیقه یه پشه دیگه اومد بالا سرم گفت: بی وجدان اون معلول بوود. لامصب داغون شدم با حرفش', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'خرس', 'body' => 'پسرها بعد 10 دقیقه به تفاهم میرسند که روز جمعه برای تفریح کجا برن . دخترها بعد 4 ساعت بحث ،تفریحشون لغو میشه چون الهه به نسترن گفت :خرس.', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'لنگه', 'body' => 'دنبال نیمه گمشدتون نگردید بعضی هام مثل ما لنگه به لنگه آفریده شدن! یعنی همون بعضیام مثل من لنگه ندارن.', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'سرعت', 'body' => 'افسر :خانم شما با سرعت غیر مجاز رانندگی میکردیدخواهش میکنم بزارید برم، من معلم هستم الان کلاسم دیر میشه . افسر :معلم؟ یه عمر منتظر این روز بودم، حالا شروع کن هزار بار بنویس “من دیگه با سرعت غیر مجاز رانندگی نمیکنم"', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'بتهون', 'body' => 'دقت کردین : بعضی اوقات بچه های کلاس با میز و نیمکت یک اهنگهایی میسازن که بتهوون که سهله بابای بتهوونم نمی تونه اونا رو بسازه', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'کتک', 'body' => 'سر ناهار دستم خورد به بطری آب همش ریخت تو غذای بابام.. هر کی بود یه چک میخوابوند زیر گوش بچه ش.....ولی بابام نزد.....بشقابشو با بشقابم عوض کرد....', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'دکل', 'body' => '‏یه جوری میگین کوالا فقط میخوره و میخوابه انگار مثلا گوسفند 5 صبح بیدار میشه یه چایی تلخ میخوره تا شب میره سر دکل نفت', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'نرده', 'body' => 'یه روز یه مرده میره میخوره به نرده بر می گرده.', 'user_id' => 1]);
        Joke::create(['title' => 'گاز', 'body' => 'یه بارم بابام کنتور گاز رو دستکاری کرد، روزی ١٣٠٠ تومن اداره گاز باید به ما پول میداد', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'خرید', 'body' => '‏یارو ﺍﺯ ﻣﻐﺎﺯﻩ ﻣﯿﺎﺩ ﺑﯿﺮﻭﻥ ﻏﺶ ﻏﺶ ﻣﯿﺨﻨﺪﻩ. می گن چی شده؟  ‏ﻣﯿﮕﻪ:رفتم مغازه اسگلشون کردم. ‏میگن:چی کار کردی…؟ ‏میگه:ﭘﻮﻝ ﺩﺍﺩﻡ ﻫﯿﭽﯽ ﻧﺨﺮﯾﺪﻡ.', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'معلول', 'body' => 'امروز یه پشه یه ربع بی حرکت نشسته بود رو میز ناهار خوری منم سریع زدم لهش کردم!! بعد از چن دقیقه یه پشه دیگه اومد بالا سرم گفت: بی وجدان اون معلول بوود. لامصب داغون شدم با حرفش', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'خرس', 'body' => 'پسرها بعد 10 دقیقه به تفاهم میرسند که روز جمعه برای تفریح کجا برن . دخترها بعد 4 ساعت بحث ،تفریحشون لغو میشه چون الهه به نسترن گفت :خرس.', 'user_id' => 2,'status'=>1]);
        Joke::create(['title' => 'لنگه', 'body' => 'دنبال نیمه گمشدتون نگردید بعضی هام مثل ما لنگه به لنگه آفریده شدن! یعنی همون بعضیام مثل من لنگه ندارن.', 'user_id' => 2,'status'=>1]);
        Joke::create(['title' => 'سرعت', 'body' => 'افسر :خانم شما با سرعت غیر مجاز رانندگی میکردیدخواهش میکنم بزارید برم، من معلم هستم الان کلاسم دیر میشه . افسر :معلم؟ یه عمر منتظر این روز بودم، حالا شروع کن هزار بار بنویس “من دیگه با سرعت غیر مجاز رانندگی نمیکنم"', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'بتهون', 'body' => 'دقت کردین : بعضی اوقات بچه های کلاس با میز و نیمکت یک اهنگهایی میسازن که بتهوون که سهله بابای بتهوونم نمی تونه اونا رو بسازه', 'user_id' => 1,'status'=>1]);
        Joke::create(['title' => 'کتک', 'body' => 'سر ناهار دستم خورد به بطری آب همش ریخت تو غذای بابام.. هر کی بود یه چک میخوابوند زیر گوش بچه ش.....ولی بابام نزد.....بشقابشو با بشقابم عوض کرد....', 'user_id' => 2,'status'=>1]);
        Joke::create(['title' => 'دکل', 'body' => '‏یه جوری میگین کوالا فقط میخوره و میخوابه انگار مثلا گوسفند 5 صبح بیدار میشه یه چایی تلخ میخوره تا شب میره سر دکل نفت', 'user_id' => 2,'status'=>1]);


//        بلد نشدم کار نکرد
//        Factory(Joke::class,3)->create();
//        Factory::create();

        }
}
